Subject: ברוך הבא לפורומים של {SITENAME}
Charset: iso-8859-8-I

{WELCOME_MSG}

אנא שמור הודעה זו לפרטיך. פרטי החשבון שלך הם:

----------------------------
שם משתמש: {USERNAME}
סיסמא: {PASSWORD}
----------------------------

החשבון שלך אינו פעיל כרגע, המנהל הראשי של המערכת צריך להפעיל אותו לפני שתוכל להתחבר. אתה תקבל הודעה נוספת כאשר הדבר יקרה.

אנא אל תשכח את הסיסמא שלך מפני שהיא הוצפנה בבסיס הנתונים ואנו לא נוכל לשנות אותה בשבילך. אך אם בכל זאת שכחת את סיסמתך, תוכל לבקש אחת חדשה שתופעל באותה דרך שהופעל חשבון זה.

תודה שנרשמת.

{EMAIL_SIG}