Subject: הפעלת סיסמא חדשה
Charset: iso-8859-8-I

שלום {USERNAME}

קיבלת הודעה זו מפני שביקשת (או מישהו אחר שמתחזה אליך) סיסמא חדשה שתשלח לחשבונך ב-{SITENAME}. אם לא ביקשת הודעה זו התעלם ממנה, אם אתה ממשיך לקבל אותה צור קשר עם המנהל הראשי של המערכת.

כדי להשתמש בסיסמא החדשה אתה צריך להפעיל אותה. כדי לעשות זאת לחץ על הקישור המסופק מתחת.

{U_ACTIVATE}

אם הצלחת תוכל להתחבר בעזרת הסיסמא הבאה:

סיסמא: {PASSWORD}

אתה יכול כמובן לשנות את הסיסמא בעצמך דרך עמוד הפרופיל. אם יש לך קשיים צור קשר עם המנהל הראשי של המערכת.

{EMAIL_SIG}