<?php
/***************************************************************************
 *                         lang_contact_faq.php [English]
 *                            -------------------
 *   begin                : Saturday, May 31, 2003
 *   version              : 3.0.0
 *   date                 : 2003/12/23 23:21
 ***************************************************************************/

//  IMPORTANT NOTICE!!
//  This version of lang_contact_faq.php is intended for use when you have installed
//  Prillian without installing the expanded version of Contact List that is
//  available separately. If you are using the expanded version of Contact List, use
//  the lang_contact_faq.php file provided in that version!

// 
// To add an entry to your FAQ simply add a line to this file in this format:
// $faq[] = array('question', 'answer');
// If you want to separate a section enter
// $faq[] = array('--', 'Block heading goes here if wanted');
// Links will be created automatically
//
// DO NOT forget the ; at the end of the line.
// Do NOT put single quotes (') in your FAQ entries, if you absolutely must then
// escape them i.e.. \'something\' or use double quotes (") at the beginning and end
// of the entries (in which case you'll need to escape any double quotes in the
// entry).
//
// The FAQ items will appear on the FAQ page in the same order they are listed in 
// this file
//
// To mention Contact List by name, use the variable
// $progname as it is used in the defaults
//

include_once($phpbb_root_path . 'language/lang_' . $board_config['default_lang'] . '/lang_contact.' . $phpEx);

$progname = $lang['Contact_List_FAQ'];

$faq[] = array('--', 'שאליות כלליות');
$faq[] = array('מה הם ' . $progname . '?', $progname . ' הם צורה שעל ידע תוכל למצוא או ליצור קשר עם משתמשים אחרים בקלות או למנוע ממשתמשים אחרים ממציאת או יצירת קשר איתך בתוכנת הציטוט. הרשימות כוללות רשימת חברים, רשימת התעלמות, ורשימת קשר בלתי מורשת. רשימת הקשר בלתי מורשת היא כמו גירסה פחותה יותר של רשימת ההתעלמות. היא מסתירה את פרטי רשימת הקשר שלך ממשתמשים הרשומים בה, אבל לא מוחקת את הנוכחות שלהם מהראייה שלך כמו רשימת התעלמות.');
$faq[] = array('אז הרשימות האלו נבנו כמו המסנג\'ר? הם עובדים בחלקים אחרים של הפורומים?', 'כן, הרשימות האלו נבנו כמו המסנג\'ר. לא, הם לא עובדים בחלקים האחרים של הפורומים, חוץ מלוח בקרת ניהול רשימת הקשר. המנהל הראשי יכול להתקין גרסה מורחבת של ' . $progname . ' כדי להוסיף פונקציות לחלקים האחרים של הפורומים, כמו הפרופילים של המשתמשים, נושאים, רשימת החברים, הודעות פרטיות, ועוד.');
$faq[] = array('כיצד אני עורך את ' . $progname . ' שלי?', 'כדי לערוך את ' . $progname . ' שלך, גש פשוט ל<a href="' . append_sid(CONTACT_URL) . '">לוח הבקרה</a>.');
$faq[] = array('כיצד אני מוסיף משתמש ל' . $progname . ' שלי?', 'לגשת ללוח הבקרה ולעבור לעמוד הרשימה הרצוייה שאליה אתה רוצה להוסיף משתמש. אחר כך הקלד את שם המשתמש בתוך הטופס ליד התחתית של העמוד וללחוץ על הכפתור הוסף משתמש.<br /><br />כדי להוסיף כמה משתשמים בפעם אחת, גש ללוח הבקרה ולחץ על הקישור ' . $lang['Add_contact_users_link'] . '. באותו עמוד, אתה יכול להקליד כמה שמות משתמשים ולהוסיף את כולם לרשימות שלך בפעם אחת.<br /><br />ישנם גם קישורים כדי להוסיף משתמש או להסיר משתמש מהרשימות שלך בחלון קרא הודעה.');

$faq[] = array('--', 'שימוש ב' . $progname);
$faq[] = array('מהם המאפיינים שמספקת רשימת החברים?', 'רשימת החברים היא הרשימה הכי שימושית משלושת הרשימות. עם רשימת החברים, אתה יכול להגביל את המשתמשים המופיעים בלקוח ההודעות המידיות לחברים המחוברים הנוכחיים בלבד (במסנג\'ר או בפורומים). אתה יכול גם לקבל הודעה על חברים שמתחברים או שמתנתקים.');
$faq[] = array('כיצד אני בוחר לקבל הודעה כאשר החברים מתחברים?', 'גש ללוח הבקרה וראה את רשימת החברים שלך. לחץ על הקישור "ערוך הגדרות קבלת התחברות והתנתקות". מעמוד זה, אתה יכול לבחור להיות מודע כאשר משתמשים מסויימים מתחברים. סמן את המשתמשים שאתה רוצה להיות מודע עליהם ולחץ על כפתור השליחה. כדי לעצור הודעה על משתמש, בטל את הסימול ממנו ולחץ על כפתור השליחה.');
$faq[] = array('מהו כפתור החבריםהנמצא בחלון שלח הודעה?', 'אתה יכול ללחוץ על כפתור זה כדי לפתוח חלון קטן עם רשימה של החברים שלך. רשימה זו נותנת לך מבט מהיר אם חבר מחובר או מנותק ולחיצה על שמור תשים אותו בשדה שם המשתמש של חלון שלח הודעה.');
$faq[] = array('מהם המאפיינים שמספקת רשימת ההתעלמות?', 'כאשר משתמש ברשימת ההתעלמות שלך, אותו משתמש לא יכול לשלוח לך הודעות מידיות. בנוסף, המשתמש לא יופיע ברשימת החברים המחוברים בלקוח ההודעות המידיות.');
$faq[] = array('מהם המאפיינים שמספקת רשימת בלא מורשים?', 'כאשר משתמש ברשימת הלא מורשים שלך, אותו משתמש לא יכול לשלוח הודעה הודעה מיידית. בנוסף, המשתמש לא יוכל לראות אותך ברשימת המשתמשים המחוברים בלקוח ההודעות המידיות.');



//
// These entries should remain in all languages and for all modifications
//
$faq[] = array('--', 'ענייני ' . $progname);
$faq[] = array('מי כתב את תוכנת ' . $progname . ' זו?', 'תוכנה זו (בצורתה ללא השינויים) נוצרה, שוחררה, וזכויות היוצרים שלה על-ידי <a href="http://darkmods.sourceforge.net/" target="_blank">Thoul</a>. היא מבוססת וכוללת כמה קודים מהפורומים של מערכת phpBB, (בצורתה ללא השינויים) שנורצה, שוחררה, וזכויות היוצרים שלה על-ידי <a href="http://www.phpbb.com/" target="_blank">קבוצת phpBB</a>. את שניהם ניתן להשיג תחת הסכם GNU רשיון ציבורי כללי ומחולקים באופן חופשי; ראה את הקישורים לפרטים נוספים.');
$faq[] = array('מדוע מאפיין X לא זמין?', 'תוכנה זו נכתבה על-ידי קבוצת ה-phpBB (במקרה של תוכנת הפורום) ו-Thoul (במקרה של ' . $progname . ' ). אם אתה מאמין שמאפיין כלשהו צריך לתוכנת ההודעות המידיות אז בקר באתר darkmods.sourceforge.net וראה אם כבר נאמר משהו על הרעיון שלך בפורומים האלו. אם לא, שלח בקת מאפיין בפורומים או דרך מימשק ה-Sourceforge.');
$faq[] = array('עם מי אני צריך ליצור קשר עם חומר מעליב או לא חוקי הקשור ל' . $progname . ' ?', 'אתה צריך ליצור קשר עם המנהל הראשי של הפורומים האלו. אין אינך מוצא מי הוא, אתה צריך ליצור קשר דבר ראשון עם אחד ממנהלי הפורומים ובקש מהם שאתה צריך ליצור איתם קשר לפי תור. אין עדיין אינך מקבל תשובה אתה צריך ליצור קשר עם שם המתחם (בצע בדיקת whois) או, אם הפורומים רצים על שרת אחסון חינמי (למשל yahoo, free.fr, f2s.com, וכדומה), ההנהלה או למחלקת השימוש לרעה של שירות זה. שים לב ש-Thoul אין שליטה לחלוטין ולא יכול לשאת באחריות מעל איך, היכן או על-ידי מי מערכת זו בשימוש. זה חסר טעם לחלוטין ליצור קשר עם Thoul בכל הקשר חוקי (cease and desist, liable, defamatory comment, etc.) שלא קשור ישירות לאתר darkmods.sourceforge.net או התוכה הבודדת של ' . $progname . ' עצמו. אם תשלח הודעה ל-Thoul על כל שימוש בצד שלישי של תוכנה זו אז אל תצפה לתשובה.');

//
// This ends the FAQ entries
//

?>