<?php

$lang['Forum_Rules_explain'] = 'העתק והדבק כאן את החוקים שלך בקוד HTML. כדי להזהיר את המשתמשים שהחוקים שונו לחץ על "משתמשים שלא קראו את החוקים" בתחתית העמוד.';
$lang['Forum_Rules_explain_NotView'] = 'כאן אפשרי להזהיר את המשתמשים, דרך הודעה פרטית, על השינויים שבוצעו לחוקים. ברשימה "משתמשים" בצד ימין נמצאים אותם משתמשים שלא קראו את החוקים ששונו בלבד.<br> <b>אזהרה!</b> האפשרויות "כל המשתמשים הרשומים" ו "שלח דואר עם הודעה פרטית" יכולות לקחת זמן רב לעיבוד.';
$lang['Send_PM_Select'] = 'משתמשים נבחרים';
$lang['Send_PM_All'] = 'כל המשתמשים הרשומים';
$lang['Send_Email_Rules'] = 'שלח דואר עם הודעה פרטית';
$lang['NotView_Rules'] = 'משתמשים שלא קראו את החוקים';
$lang['Send_PM_to'] = 'שלח הודעה פרטית ל';
$lang['Save'] = 'שמור';
$lang['Send'] = 'שלח';
$lang['Modify'] = 'שנה';
$lang['Users_NotView_Rules'] = 'משתמשים';
$lang['Select_User_First'] = 'אתה צריך לבחור ראשית משתמש';
$lang['Click_return_Rules'] = 'לחץ %sכאן%s כדי לחזור לחוקים';

?>