<?php
/***************************************************************************
 *                            lang_faq_attach.php [Hebrew]
 *                              -------------------
 *     begin                : Tue Feb 12 2002
 *     copyright			: (C) 2002 torgeir andrew waterhouse
 *     email				: torgeir.waterhouse@forbrukerradet.no
 *
 *     $Id: lang_faq_attach.php,v 1.2 2002/08/11 15:37:32 meik Exp $
 *
 ****************************************************************************/

/***************************************************************************
 *
 *   This program is free software; you can redistribute it and/or modify
 *   it under the terms of the GNU General Public License as published by
 *   the Free Software Foundation; either version 2 of the License, or
 *   (at your option) any later version.
 *
 ***************************************************************************/

$faq[] = array("--","צירוף קבצים");

$faq[] = array("כיצד אני מצרף קובץ?", "אתה יכול לצרף קבצים כאשר אתה שולח הודעה חדשה. אתה צריך לראות את הטופס <i>הוסף קובץ</i> תחת תיבת הההודעה. כאשר תלחץ על הכפתור <i>עיון...</i> חלון הדו-שיח פתיחה הרגיל של המחשב שלך יפתח. עיין לקובץ שאתה רוצה לצרף, בחר אותו ולחץ אישור, פתח או לחיצה כפולה לפי רצונך ו/או לפי הצורה הנכונה של המחשב שלך. אם אתה בוחר להוסיף הערה בשדה <i>הערת הקובץ</i> הערה זו תשמש כקישור לקובץ שצורף. אם לא הוספת הערה שם הקובץ עצמו ישמש כקישור לקובץ. אם המנהל הראשי של המערכת מאפשר לך לעשות זאת תוכל להעלות כמה קבצים על-ידי ביצוע אותה הפעולה המתוארת מעל עד שתגיע למספר המירבי המאופשר של קבצים לכל הודעה.<br/><br/>המנהל הראשי של המערכת קובע הגבלה לגודל הקובץ, מגדיר סיומות קבצים לדברים אחרים לצירוף הקבצים במערכת. שים לב שזו אחריותך בלבד של הקבצים שלך לא עוברים על הסכמי השימוש בפורומים, ושהם יכולים להמחק ללא אזהרה.<br/><br/>שים לב שבעל הפורומים, מנהל האתר, המנהל הראשי או המנהלים לא יכולים ולא ישאו באחריות לכל אבדן נתונים.");

$faq[] = array("כיצד אני מצרף קובץ לאחר השליחה?", "כדי לצרף קובץ לאחר השליחה אתה צריך לערוך את ההודעה שלך ולעקוב אחר התיאור מעל. הקובץ החדש יתווסף כאשר תלחץ על <i>שליחה</i> כדי להוסיף את ההודעה שנערכה.");

$faq[] = array("כיצד אני מוחק קובץ?", "כדי למחוק קבצים אתה צריך לערוך את ההודעה שלך וללחוץ על <i>מחק קובץ</i> ליד הקובץ שאתה רוצה למחוק בתיבה <i>קבצים שנשלחו</i>. הקובץ ימחק כאשר תלחץ על <i>שליחה</i> כדי להוסיף את ההודעה שנערכה.");

$faq[] = array("כיצד אני מעדכן את הערת הקובץ?", "כדי לעדכן את הערת הקובץ אתה צריך לערוך את ההודעה שלך, לערוך את הטקסט בשדה <i>הערת הקובץ</i> וללחוץ על הכפתור <i>עדכן הערה</i> ליד הערת הקובץ שאתה רוצה לעדכן בתיבה <i>קבצים שנשלחו</i>. הערת הקובץ תעודכן כאשר תלחץ על <i>שליחה</i> כדי להוסיף את ההודעה שנערכה.");

$faq[] = array("מדוע הקובץ שלי לא ניתן לצפייה בהודעה?", "כנראה הקובץ או הסיומת אינם מאופשרים יותר בפורום, או שמנהל או מנהל ראשי מחקו אותו בגלל שהוא לא הסכים עם הסכמי השימוש של הפורומים.");

$faq[] = array("מדוע אני לא יכול לצרף קבצים?", "בכמה פורומים הוספת קבצים יכולה להיות מגבלת למשתמשים מסויימים או קבוצות. כדי לצרף קבצים יכול להיות שתצטרך גישה מיוחדת, רק מנהל פורום ומנהל ראשי של המערכת יכולים לאפשר גישה כזאת, אתה צריך ליצור קשר איתם.");

$faq[] = array("קיבלתי את הגישות הנדרשות, מדוע אני לא יכול לצרף קבצים?", "המנהל הראשי של המערכת קובע קובע הגבלה לגודל הקובץ, סיומות קבצים ודברים אחרים לצירוף הקבצים בפורום. מנהל או מנהל ראשי יכולים לשנות את הגישות שלך, או לא להמשיך צירוף קבצים בפורום מסויים. אתה צריך לקבל הסבר בהודעת שגיאה כאשר תנסה לצרף קובץ, אם לא אולי תשקול ליצור קשר עם מנהל או מנהל ראשי.");

$faq[] = array("מדוע אני לא יכול למחוק קבצים?", "בכמה פורומים מחיקת קבצים יכולה להיות מוגבלת למשתמשים מסויימים או קבוצות. כדי למחוק קבצים יכול להיות שתצטרך גישה מיוחדת, רק מנהל פורום ומנהל ראשי יכולים לאפשר גישה כזאת, אתה צריך ליצור קשר איתם.");

$faq[] = array("מדוע אני לא יכול לצפות/להוריד קבצים?", "בכמה פורומים צפייה/הורדה של קבצים יכולה להיות מוגבלת למשתמשים מסויימים או קבוצות. כדי לצפות/להוריד קבצים יכול להיות שתצטרך גישה מיוחדת, רק מנהל פורום ומנהל ראשי יכולים לאפשר גישה כזאת, אתה צריך ליצור קשר איתם.");

$faq[] = array("עם מי אני צריך ליצור קשר על חומר לא חוקי או קבצים לא חוקיים אפשריים?", "אתה צריך ליצור קשר עם המנהל הראשי של מערכת זו. אם אתה לא יכול למצוא מי הוא אתה צריך ראשית ליצור קשר עם אחד ממנהלי הפורום ולשאול אותם למי אתה צריך לפנות כדי ליצור איתו קשר. אם אתה עדיין לא מקבל תשובה אתה צריך ליצור קשר עם בעל המתחם (בצע בדיקת whois) או, אם הוא מורץ על שירות חינם (למשל yahoo, free.fr, f2s.com, וכדומה.), ההנהלה או המחלקה לטיפול בדברים כאלו של השירות. שים לב שקבוצת phpBB אין לחלוטין שליטה ולא יכולה בשום דרך לשאת באחריות מעל איך, היכן או על-ידי מי מערכת זו בשימוש. זה מיותר לחלוטין ליצור קשר עם קבוצת phpBB בהקשר לכל חומר חוקי או לא חוקי (הפסקה והמנעות, אחריות, הערות משמיצות, וכדומה.) ולא להתייחס ישירות לאתר phpbb.com או התוכנה בנפרד של phpBB עצמה. אם תשלח הודעה לקבוצת phpBB על כל שימוש בצד שלישי של תוכנה זו אז אתה צריך לצפות לתשובה קצרה או ללא תשובה כלל.");

?>