Subject: ברוך הבא לפורומים של {SITENAME}
Charset: iso-8859-8-I

{WELCOME_MSG}

בהתאמה עם ה-COPPA פעילות חשבונך כרגע אינה פעילה.

אנא הדפס הודעה זו ובקש מההורה או האפוטרופוס שלך שיחתום ויכתוב תאריך. אחר כך פקסס את ההודעה ל:

{FAX_INFO}

או בדואר ל:

{MAIL_INFO}

------------------------------ חתוך כאן ------------------------------
גישה להשתתפות ב-{SITENAME}

שם משתמש: {USERNAME}
סיסמא: {PASSWORD}
דואר אלקטרוני: {EMAIL_ADDRESS}

מספר ICQ: {ICQ}
כתובת AIM: {AIM}
מסנג'ר MSN: {MSN}
מסנג'ר Yahoo: {YIM}
אתר אינטרנט: {WEB_SITE}
מאת: {FROM}
מקצוע: {OCC}
תחביבים: {INTERESTS}

קראתי את המידע שסופק על-ידי בני וזאת אני מרשה ל-{SITENAME} לאחסן מידע זה. 
אני מבין שניתן לשנות מידע זה בכל פעם על-ידי הקלדת סיסמא. 
אני מבין שאני יכול לבקש להסיר מידע זה מ-{SITENAME} בכל פעם.


הורה או אפוטרופוס 
(כתוב את שמך כאן): _____________________

(חתום כאן): __________________ 

תאריך: _______________

------------------------------ לחץ כאן ------------------------------


כאשר המנהל הראשי יקבל את הטופס שמעל דרך הפקס או דואר רגיל חשבונך יופעל.

אנא אל תשכח את סיסמתך מפני שהיא הוצפנה בבסיס הנתונים ואנו לא נוכל לשחזר אותה בשבילך. אך אם בכל זאת תשכח את סיסמתך, תוכל לבקש אחת חדשה שתופעל באותה דרך שהופעל חשבון זה.

תודה שנרשמת.

{EMAIL_SIG}
