<?php
/***************************************************************************
 *                        lang_prillinstall.php [Hebrew]
 *                            -------------------
 *   begin                : Saturday, July 10, 2004
 *   copyright            : (C) 2004 masterdavid - Ronald John David
 *   website              : http://www.integramod.com
 *   email                : webmaster@integramod.com
 *
 *   note: removing the original copyright is illegal even you have modified
 *         the code.  Just append yours if you have modified it.
 ***************************************************************************/

/***************************************************************************
 *
 *   This program is free software; you can redistribute it and/or modify
 *   it under the terms of the GNU General Public License as published by
 *   the Free Software Foundation; either version 2 of the License, or
 *   (at your option) any later version.
 *
 ***************************************************************************/

//
// Prillian Install Process
//
$lang['Installation'] = 'התקנה';
$lang['Thanx'] = 'תודה שבחרת ב-%s, תוכנת הדיבור המיידי המקורית ל-phpBB! אם יש לך בעיות, בדוק את הקובץ readme.txt למיקומים שבהם תוכל לבקש תמיכה.';
$lang['No_redirect'] = 'אם הדפדפן שלך לא תומך בהפניית meta אנא לחץ %sכאן%s כדי לעבור.';
$lang['Attempt_schema_read'] = 'מנסה לקרוא לקובץ המבנה של ה-SQL:';
$lang['Attempt_create_tables'] = 'מנסה ליצור טבלאות בסיס נתונים חדשות:';
$lang['Table'] = 'טבלה';
$lang['Created'] = 'נוצר';
$lang['Query'] = 'שאילתה';
$lang['Completed'] = 'הושלם';
$lang['Attempt_alter_read'] = 'מנסה לקרוא את קובץ ה-SQL של שינוי הטבלה:';
$lang['Attempt_alter_tables'] = 'מנסה לשנות טבלאות בסיס נתונים:';
$lang['Table_alterations'] = 'שינויי טבלה';
$lang['Undetermine'] = 'לא ניתן לקבוע מה לעשות!';
$lang['Successful'] = 'הצליח!';
$lang['Failed'] = 'נכשל!';
$lang['Error_follows'] = 'הודעת שגיאה הבאה:';
$lang['Successfully'] = 'בהצלחה';
$lang['Attempt_delete_tables'] = 'מנסה למחוק טבלאות בסיס נתונים:';
$lang['Deletion'] = 'מחיקה';
$lang['Attempt_delete_alternations_tables'] = 'מנסה למחוק שינויים לטבלאות בסיס נתונים:';
$lang['Alteration'] = 'שינוי';
$lang['Step_1'] = 'זהו שלב 1 מתוך 5!';
$lang['Step_1_intro'] = 'אנו ננסה עכשיו להתקין טבלאות בסיס נתונים חדשות.';
$lang['Step_1_error'] = '<br />ישנה שגיאה! אם כל אחת מאותן טבלאות לא נוצרה וכבר לא קיימת, אז אתה יכול לבצע את השאילתות בקובץ *_im_schema.sql לסוג בסיס הנתונים שלך בעצמך. להלן כמה שגיאות שיכולות לקרות בשלב זה:<ul><li><span class="bold">שגיאה: מנסה לקרוא לקובץ ה-SQL של המבנה: נכשל!</span><br />וודא שקבצי *.sql באותה תיקייה כמו im_install.php!</li><li><span class="bold">שגיאה: הטבלה "%s" כבר קיימת</span><br />אם כבר התקנת את מוד רשימת הקשר של Thoul, לא לדאוג על זה. גם רשימת קשר וגם Prillian מנסים ליצור טבלה זו בהתקנה. כל עוד אחד מהם עשה כך, אתה בסדר.</li><li><span class="bold">שגיאה: הטבלה "%s" כבר קיימת</span><br />אם אחת מהטבלאות האחרות כבר קיימת, הייא יכולה להשאר מההתקנה הקודמת של Prillian או מהתקנת Prillian Lite. להתקנת Prillian Lite, אתה צריך לעצור עכשיו ולהסיר את התקנת Prillian Lite. להתקנת Prillian, אתה צריך לבצע כמה שינויים לטבלאות בעצמך מאוחר יותר.</li></ul>';
$lang['Step_no_errors'] = 'לא נמצאו שגיאות בשלב זה.';
$lang['Step_2'] = 'זהו שלב 2 מתוך 5!';
$lang['Step_2_intro'] = 'אנו נסה להעתיק את כל המשתמשים הקיימים של לתוך טבלת בסיס הנתונים %s.';
$lang['Step_2_error_get_list'] = 'נכשל בקבלת רשימת ה-user_ids להוספה';
$lang['Step_2_user_success'] = '%s משתמשים מתוך %s הועתקו בהצלחה לטבלה.';
$lang['Step_2_user_failed'] = 'אף משתמשים מתוך %s הועתקו לטבלה.';
$lang['Step_2_error'] = '<br /><br /><span class="err_msg">אותם משתמשים שלא הועתקו: %s.</span><br /><br />אותם משתמשים יכולים להיות כבר בטבלה או שההעתקה פשוט נכשלה. במקרה האחרון, אתה צריך להוסיף את המשתמשים בעצמך. כדי לעשות זאת, אתה תצטרך להרית את שאילתות ה-SQL שלהלן לתוך phpMyAdmin או שירות דומה. אם אין לך שירות כמו זה, נסה לעבור לחלק השירותים של phpBBHacks.com ולבדוק שם את עמוד db_generator.<br /><br /><span class="query_msg">';
$lang['Step_3'] = 'זהו שלב 3 מתוך 5!';
$lang['Step_3_intro'] = 'אנו ננסה להוסיף נתונים חדשים, כולל הרבה אפשרויות הגדרות חדשות.';
$lang['Step_3_error'] = '<br />ישנה שגיאה! אם אף אחד מהשאילתות לא הושלמו בהצלחה וכבר לא קיימות, אז יכול להיות בעייה בהרצת Prillian מאוחר יותר! להלן כמה שגיאות שיכולות לקרות בשלב זה:<ul><li><span class="bold">שגיאה: מנסה לקרוא לקובץ ה-SQL של הנתונים: נכשל!</span><br />וודא שקבצי *.sql באותה תיקייה כמו im_install.php!</li><li><span class="bold">שגיאות Duplicate entry</span><br />הודעת שגיאה זו אומרת שהנתונים בשאילתה מסויימת זו נוספו כבר כנראה לטבלאות שלך. בדרך כלל, זוהי לא שגיאה שצריך לדאוג בגללה אז אתה יכול להתעלם ממנה.</li></ul>';
$lang['Step_4'] = 'זהו שלב 4 מתוך 5!';
$lang['Step_4_intro'] = 'אנו ננסה עכשיו לשנות את טבלאות בסיס הנתונים הקיימות שלך כדי להחזיק בהם נתונים חדשים.';
$lang['Step_4_error'] = '<br />ישנה שגיאה! אם אף אחת מהשאילתות לא הושלמו בהצלחה וכבר לא קיימות, אז יכול להיות בעייה בהרצת Prillian מאוחר יותר! להלן כמה שגיאות שיכולות לקרות בשלב זה:<ul><li><span class="bold">שגיאה: מנסה לקרוא לקובץ ה-SQL של שינוי הטבלה: נכשל!</span><br />וודא שקבצי *.sql באותה תיקייה כמו im_install.php!</li><li><span class="bold">שגיאות Duplicate column name or key name</span><br />הודעת שגיאה זו אומרת ששינויי הטבלה בשאילתה מסויימת נוספו כבר כנראה לטבלאות שלך. בדרך כלל, זוהי לא שגיאה שצריך לדאוג בגללה אז אתה יכול להתעלם ממנה.</li></ul>';
$lang['Step_5'] = 'זהו שלב 5 מתוך 5!';
$lang['Step_5_intro'] = 'ברכותינו, סיימת את התקנת Prillian!<br /><br />אם נתקלת בשגיאות, אז השלב הבא שלך שצריך להיות הוא להעלות את כל קבצי ה-Prillian או קבצי ה-phpBB ששונו שכבר העלת.<br /><br />אם תתקל בשגיאה, אז אתה צריך לבצע כמה שינויים בעצמך לבסיס הנתונים דרך שירות אחר.<br /><br />אם בכל מקרה, כאשר כל הקבצים שלך הועלו וכל השינויים הידניים לבסיס הנתונים הושלמו, אתה צריך לעבור ללוח הניהול ולהשתמש בעמוד הגדרות Prillian החדש כדי לסיים את ההגדרות להתקנת Prillian שלך.<br /><br /><span class="err_msg">אנא מחק את התיקייה prill_install לפני הביצוע.</span><br /><br />';
$lang['Step_5_proceed'] = 'מחקתי את התיקייה prill_install... בוא נשלים את פרטי ההרשמה שנותרו לחשבון שלך';
$lang['Step_0'] = 'זהו שלב 0 מתוך 5!';
$lang['Step_0_intro'] = 'בסדר, בחרת להתקין את Prillian! ההתקנה תבוצע בכמה שלבים כך שתוכל לראות מה התסריט ינסה להתקין וכל שגיאות שיכולות להתרחש. כאשר שלב ממהתקנה יושלם, אתה יכול לעבור לשלב הבא על-ידי לחיצה על הקישור עבור לשלב הבא. בזמן שתעבור, כמה טיפים ועצות על שגיאות נפוצות שאתה יכול להתקל בהם יוצגו.<br /><br />לפני כל מהלך בעתיד, אתה אולי תרצה לשנות כמה מערכי ברירת המחדל המוגדרים ל-phpbb_im_prefs בקובץ *_im_schema.sql שבו תשתמש כדי להתקין את טבלאות בסיס הנתונים. אותם ערכי ברירת מחדל יופיעו לכל המשתמשים במשך התקנה זו והרשמה (לכל המשתמשים שבעתיד). אם אתה רוצה לאפשר גישה ל-Prillian רק לכמה משתמשים, שינוי כמה מהם זה רעיון טוב.<br /><br />עבור לשלב הבא כדי להתחיל בהתקנת Prillian!';
$lang['Proceed'] = 'עבור לשלב הבא';
$lang['Delete_step'] = 'בסדר, אם אתה בטוח שאתה רוצה למחוק את Prillian, אז עשה זאת.';
$lang['Choose_Install'] = 'לפני הביצוע, אנא וודא שהעלת את הקבצים %s החדשים של phpBB והקובץ %s הערוך. אם אותם קבצים לא הועלו, אתה לא תוכל להשתמש בהתקנה זו כנדרש.<br /><br />אנא בחר שיטת התקנה:<ul><li>%s התקנת %s חדש %s</li><li>%s שדרוג מהתקנה קודמת %s - <span class="bold">סליחה, אפשרות זו לא זמינה ב-%s </span></li><li>%s הסרת שינויי בסיס הנתונים של %s %s</li></ul>';
$lang['Confirm_Delete'] ='בחרת להסיר את שינויי בסיס הנתונים של %s. זה יעשה את %s לא בשימוש, אז אתה יכול להסיר את את השיוניים לקבצי phpBB המקוריים (חוץ מ-%s) ראשית כדי למנוע מהפורום שלך לקרוס. אתה צריך גם לגבות את טבלאות בסיס הנתונים שלך במקרה של שגיאות. אם אתה עושה זאת ואתה רוצה להסיר את שינויי בסיס הנתונים, לחץ על הקישור להלן.<ul><li>%s הסר את שינויי בסיס הנתונים %s</li></ul></div>';
$lang['Already_installed'] ='כבר התקנת את %s או גרסה מאוחרת יותר.';
?>